#include <iostream>
using namespace std;
int main9() {
    //std::cout << "Hello, World!" << std::endl;
    /*
        循环结构
		    1. while循环
			2. do while循环
			3. for循环
			4. range for循环
    */

    cout << "--------------------------------------------------------------------------------------------------while语句" << endl;
    /*
		while(条件)
		{
			执行语句
		}
		// 先判断条件，再执行
    */
    // 打印0-9
	int i = 0;
	while (i < 10)
	{	
		cout << i << " ";
		i++;
	}	
	cout << endl;

	cout << "--------------------------------------------------------------------------------------------------do while语句" << endl;
	/*
		do
		{
			执行语句
			}while(条件);
			// 先执行一次，再判断条件
	*/
	// 打印0-9
	i = 0;
	do
	{	
		cout << i << " ";
		i++;	
	} while (i < 10);
	cout << endl;

	cout << "--------------------------------------------------------------------------------------------------for语句" << endl;
	/*
		for(初始表达式; 条件表达式; 迭代表达式)
		{
			执行语句
		}
	*/
	// 打印0-9
	for (int i = 0; i < 10; i++)
	{
		cout << i << " ";
	}
	cout << endl;

	cout << "--------------------------------------------------------------------------------------------------range for语句" << endl;
	/*
		range for语句
		for(数据类型 变量 : 容器)
		{
			执行语句
		}
	*/
	// 打印数组
	int arr[5] = { 1,2,3,4,5 };
	for (int i : arr)
	{
		cout << i << " ";
	}
	cout << endl;    // 1 2 3 4 5

	// 乘法表
	cout << "--------------------------------------------------------------------------------------------------乘法表" << endl;
	for (int i = 1; i <= 9; i++)
	{	
		for (int j = 1; j <= i; j++)
		{
			cout << i << "*" << j << "=" << i * j << "\t";
		}
		cout << endl;
	}
	
	// break 和 continue
	cout << "--------------------------------------------------------------------------------------------------break和continue" << endl;
	/*
		break 			跳出循环
		continue		跳过本次循环
	*/
	// break
	for (int i = 0; i < 10; i++)
	{
		if (i == 5)
		{
			break;  // 跳出循环
		}
		cout << i << " ";
	}
	cout << endl;
	// continue
	for (int i = 0; i < 10; i++)
	{
		if (i == 5)
		{
			continue;  // 跳过本次循环
		}
		cout << i << " ";
	}
	cout << endl;

	// goto 语句
	cout << "--------------------------------------------------------------------------------------------------goto语句" << endl;
	/*
		goto 标签;
		标签:
		执行语句;
	*/
	goto label;  // 跳转到标签
	cout << "这句话不会被执行" << endl;
label:
	cout << "这句话会被执行" << endl;
	// goto 语句不推荐使用，容易导致代码混乱
	// 但是在某些情况下，goto语句可以简化代码
	// 例如在嵌套循环中，使用goto语句可以跳出多层循环

    system("pause");
    return 0;
}