#include <iostream>
using namespace std;
int main10() {
    //std::cout << "Hello, World!" << std::endl;
    // 数组：
	// 1. 数组是一个数据结构，可以存储多个相同类型的数据
	// 2. 数组的大小在定义时就确定了，必须是正整数，不能动态改变
	// 3. 数组的下标从0开始
	// 4. 数组的元素可以通过下标访问
	// 5. 数组的元素可以是任意类型，包括基本数据类型和自定义数据类型，但是一个数组中的元素类型必须相同
		

	cout << "--------------------------------------------------------------------------------------------------一维数组的定义" << endl;
    // 一维数组的定义 // 定义一个大小为5的整型数组
	int arr1[5];
	// 数组的初始化，初始化没有填满，其他元素默认值为0；定义数组的时候不写大小，编译器会自动计算大小；
	int arr2[5] = { 1,2,3,4,5 }; // 定义一个大小为5的整型数组，并初始化
	// 数组的地址
	cout << "arr2的地址为：" << arr2 << endl; // 输出数组的地址，地址是数组的首元素的地址
	// 数组首位元素的地址，&是取地址符
	cout << "arr2[0]的地址为：" << &arr2[0] << endl; // 输出数组的首位元素的地址
	cout << "数组的地址就是数组首位元素的地址" << endl << endl;
	// 数组的大小
	cout << "arr2的大小为：" << sizeof(arr2) << endl; // 输出数组的大小 4 bytes * 5 = 20 bytes
	// 数组的长度
	cout << "arr2的长度为：" << sizeof(arr2) / sizeof(arr2[0]) << endl; // 输出数组的长度 20 bytes / 4 bytes = 5
	// 数组的遍历
	cout << "arr2的遍历：" << endl;
	for (int i = 0; i < 5; i++)
	{
		cout << "\t" << arr2[i] << " "; // 输出数组的元素
	}
	cout << endl << endl;


	cout << "--------------------------------------------------------------------------------------------------二维数组的定义" << endl;
	// 二维数组的定义 // 定义一个大小为3*4的整型二维数组
	int arr3[3][4];
	// 数组的初始化，初始化没有填满，其他元素默认值为0；初始化的时候不写大小，编译器会自动计算大小；
	int arr4[3][4] = { { 1,2,3,4 },{ 5,6,7,8 },{ 9,10,11,12 } }; // 定义一个大小为3*4的整型二维数组，并初始化
	// 数组的地址
	cout << "arr4的地址为：" << arr4 << endl; // 输出数组的地址，地址是数组的首元素的地址
	// 数组首位元素的地址，&是取地址符
	cout << "arr4[0][0]的地址为：" << &arr4[0][0] << endl; // 输出数组的首位元素的地址
	cout << "数组的地址就是数组首位元素的地址" << endl << endl;
	// 数组的大小
	cout << "arr4的大小为：" << sizeof(arr4) << endl; // 输出数组的大小 4 bytes * 3 * 4 = 48 bytes
	// 数组的行和列数
	cout << "arr4的行数为：" << sizeof(arr4) / sizeof(arr4[0]) << endl; // 输出数组的行数 48 bytes / 16 bytes = 3
	cout << "arr4的列数为：" << sizeof(arr4[0]) / sizeof(arr4[0][0]) << endl; // 输出数组的列数 16 bytes / 4 bytes = 4
	cout << "arr4的长度为：" << sizeof(arr4) / sizeof(arr4[0][0]) << endl; // 输出数组的长度 48 bytes / 4 bytes = 12
	// 数组的遍历
	cout << "arr4的遍历：" << endl;
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 4; j++)
		{
			cout << "\t" << arr4[i][j] << " "; // 输出数组的元素
		}
		cout << endl;
	}
	
    system("pause");
    return 0;
}