#include <iostream>
using namespace std;
int main12() {
    //std::cout << "Hello, World!" << std::endl;
    // 指针的基本概念
    // 可以通过指针来访问内存地址
    // 通过指针变量来保存地址

    cout<<"--------------------------------------------------------指针的定义和使用"<<endl;
    // 指针的定义和使用
    int a = 10;
    // 数据类型 * 指针变量名
    int *p = &a;    // & 取地址
    // 指针的数据类型要和变量的数据类型一致
    // 可以简单的理解成 * 是定义指针p  =  取a的地址，p实际上是地址
    // *p 是取地址的值，解引用    

    cout << p << endl; // 输出地址
    cout << *p << endl; // 输出值，解引用 20

    cout<<"--------------------------------------------------------指针内存空间"<<endl;
    // 指针所占的内存空间 64位系统：8bytes
    cout <<"指针占用的内存"<< sizeof(p) << endl;   // 输出指针所占的内存空间 8

    cout<<"--------------------------------------------------------空指针"<<endl;
    // 空指针 指向内存中编号为0的空间
    int *p1 = nullptr;  // 可以用来初始化指针变量
    cout << p1 << endl;  // 输出空指针地址 000000000000
    //cout << *p1 << endl;  // 输出空指针的值，空指针解引用会报错

    cout<<"--------------------------------------------------------野指针"<<endl;
    // 野指针 指向了内存中不存在的空间
    int *p2 = (int *)0x12345678;  
    cout << p2 << endl;  // 输出野指针地址 12345678
    //cout << *p2 << endl;  // 输出野指针的值，野指针解引用会报错

    cout<<"--------------------------------------------------------const修饰指针"<<endl;
    // const 修饰指针，常量指针
    const int *p3 = &a;     // 常量指针,指针的指向可以修改，指针指向的值不能修改
    cout << p3 << endl;
    cout << *p3 << endl;
    // p = &b;  // 正确，指针的指向可以修改
    // *p3 = 20; // 错误，指针指向的值不能修改
    
    // const 修饰常量，指针常量
    int const *p4 = &a;     // 指针常量，指针的指向不能修改，指针指向的值可以修改
    cout << p4 << endl;
    cout << *p4 << endl;
    //p4 = &b; // 错误，指针的指向不能修改
    //*p4 = 20; // 正确，指针指向的值可以修改
   
    // const 修饰指针和常量
    const int *const p5 = &a;     // 指针和值都为常量
    cout << p5 << endl;
    cout << *p5 << endl;
    //p5 = &b; // 错误，指针的指向不能修改
    //*p5 = 20; // 错误，指针指向的值不能修改

    cout<<"--------------------------------------------------------指针和数组"<<endl;
    // 指针和数组
    int arr[5] = {1, 2, 3, 4, 5};
    int *p6 = arr;  // 指针指向数组的首地址
    cout << p6 << endl;

    cout << *p6 << " "; // 数组的下标和指针的加减运算是等价的
    cout << *(p6 + 1) << " ";  // p6 + 1 相当于 p6 指针向后偏移一个字节，也就是 p6 + 1 * sizeof(p)
    cout << *(p6 + 2) << " ";
    cout << *(p6 + 3) << " ";
    cout << *(p6 + 4) << " ";
    cout << endl;
    cout << p6[0] << " ";
    cout << p6[1] << " ";
    cout << p6[2] << " ";
    cout << p6[3] << " ";
    cout << p6[4] << " ";
    cout << endl;
    cout << arr[0] << " "; // 数组的下标和指针的加减运算是等价的
    cout << arr[1] << " ";
    cout << arr[2] << " ";
    cout << arr[3] << " ";
    cout << arr[4] << " ";
    cout << endl;

    system("pause");
    return 0;
}